# IsDone Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilteredWorksetIterator..::..IsDone Method
FilteredWorksetIterator Class See Also
---
Identifies if the iteration has completed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public virtual bool IsDone()
```

Visual Basic
---
```text
Public Overridable Function IsDone As Boolean
```

Visual C++
---
```text
public:
virtual bool IsDone()
```

# ### Return Value
True if the iteration has no more matching worksets. False if there are more worksets to be iterated.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The FilteredWorksetCollector that yielded this iterator has been reset by another operation. No further iteration is permitted with this iterator. |

# See Also
FilteredWorksetIterator Class
Autodesk.Revit.DB Namespace